In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv("weather_data.csv")

In [4]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [10]:
new_df=df.replace(-99999,np.NaN)

In [11]:
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0      0
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0      0

Here, -99999 is relaced by NaN but what if two special values are there we can do like the foloowing

new_df=df.replace([-99999,-88888],np.NaN)
new_df

We can do like this but here 0 is also present. We can replace zero with the NaN value. However, 0 in windspeed is a valid value and we have to replace the value based on the specific column.

In [16]:
new_df=df.replace({
    'temperature':-99999,
    'windspeed':-99999,
    'event':'0'},np.NaN)

In [17]:
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0    NaN
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

Here, we have replaced values based on specific columns.

Replacing value we can also use a simple dictionary where we can write the value which we like to replace.

In [22]:
new_df=df.replace({
    -99999:np.NaN,
    '0':'Sunny'
})

In [23]:
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0  Sunny
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0  Sunny

In [24]:
df1=pd.read_excel("new_weather.xlsx",'Sheet1')

In [25]:
df1

         day temperature windspeed  event
0 2017-01-01         32F      6mph   Rain
1 2017-01-02      -99999      7mph  Sunny
2 2017-01-03          28    -99999   Snow
3 2017-01-04      -99999         7      0
4 2017-01-05         32C    -99999   Rain
5 2017-01-06          31         2  Sunny
6 2017-01-06          34         5      0

Use of Regex

In [26]:
new_df1=df.replace({
    'temeprature':'[A-Za-z]',
    'windspeed':'[A-Za-z]',
},'',regex=True)

In [28]:
new_df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

Here, we could have also done 
new_df1=df1.replace('[A-Za-z]','',regex=True)
But we can't do that because it also erases the events with all the text values giving only the place to the two 0 values there.

Now, we are going to replace list with another list.

In [31]:
df = pd.DataFrame({
    'superhero': ['spiderman','batman', 'hulk','professor-x'],
    'actor': ['andrew garfield', 'george clooney', 'edward norton', 'patrick stewart']
})
df

     superhero            actor
0    spiderman  andrew garfield
1       batman   george clooney
2         hulk    edward norton
3  professor-x  patrick stewart

In [32]:
new_df=df.replace(['andrew garfield','george clooney','edward norton','patrick stewart'],['tom holland','robert pattinson','mark ruffalo','james mcavoy'])

In [33]:
new_df

     superhero             actor
0    spiderman       tom holland
1       batman  robert pattinson
2         hulk      mark ruffalo
3  professor-x      james mcavoy

In [41]:
new_df.to_csv("superheroes.csv",index=False)

Reading back from the saved csv

In [43]:
new_df1=pd.read_csv("superheroes.csv")

In [44]:
new_df1

     superhero             actor
0    spiderman       tom holland
1       batman  robert pattinson
2         hulk      mark ruffalo
3  professor-x      james mcavoy